content.org
:CONFIG:
#+hugo_base_dir: ./
#+hugo_section: ./
#+hugo_weight: auto
#+hugo_autoset_lastmod: t

#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+property: header-args :eval never-export
:END:

#+title: walkergriggs.com source file
#+author: Walker Griggs
#+email: walkergriggs.com

** About
:PROPERTIES:
:export_hugo_section: pages
:export_file_name: about
:END:

#+begin_center
*Hi, my name is Walker Griggs, and I reboot your servers.*
#+end_center

*** Who

I'm an infrastructure and software engineer living in San Francisco and focusing on public cloud technologies and distributed systems.

*** What

I'm passionate about bleeding edge technology that powers and transforms our day to day, my educational background in Computer Science and English, and I'm urious about every aspect of full-stack development.

Outside of the office, my interests lie heavily in *nix advancement, container orchestration, and distributed cloud computing, and cycling!

Here are some of the technologies I'm familiar with:

- Kubernetes and Docker
- Golang, Ruby, and Python
- RHEL, CentOS, and Ubuntu
- Postgres
- Terraform
- Amazon Web Services

*** Where

**** Senior Infrastructure Engineer @ [[https://heroku.com][Heroku]]


**** Co-Founder and Advisor @ [[https://outdoorly.com][Outdoorly]]

- Created an e-commerce marketplace with an intuitive, multi-tenant shopping experience.
- Attended global trade shows to garner the interest of trending winter sports brands.
- Brought the pro-form model to the European market, disrupting the current, outdated distribution model.

**** Infrastructure Engeering Intern @ [[https://salesforce.com][Salesforce]]

- Engineered automated cloud architecture with AWS, Terraform, and CoreOS.
- Developed Terraform testing framework with dynamic resource modeling for granular unit tests.
- Worked on custom Cloudflare analytics pipeline using Docker, Kubernetes, and Grafana.
- Recipient of the 2018 Mark Benioff Award for most innovating intern.

**** Personal Investing and Digital Platforms Intern @ [[https://fidelity.com][Fidelity]]

- Designed and developed new, internals solutions for enhanced productivity and user experience.

*** What is this site?

Aside from being a personal website, this site hosts my thoughts -- young, old, ill-informed, and carefully considered.

Every word on this site is generated from an Emacs Org file, renered by Hugo, and hosted on Heroku.

