content/pages/about.md
+++
title = "About"
author = ["Walker Griggs"]
draft = false
creator = "Emacs 27.2 (Org mode 9.4.4 + ox-hugo)"
weight = 2001
+++

<style>.org-center { margin-left: auto; margin-right: auto; text-align: center; }</style>

<div class="org-center">
  <div></div>

**Hi, my name is Walker Griggs, and I reboot your servers.**

</div>


## Who {#who}

I'm an infrastructure and software engineer living in San Francisco and focusing on public cloud technologies and distributed systems.


## What {#what}

I'm passionate about bleeding edge technology that powers and transforms our day to day, my educational background in Computer Science and English, and I'm urious about every aspect of full-stack development.

Outside of the office, my interests lie heavily in \*nix advancement, container orchestration, and distributed cloud computing, and cycling!

Here are some of the technologies I'm familiar with:

-   Kubernetes and Docker
-   Golang, Ruby, and Python
-   RHEL, CentOS, and Ubuntu
-   Postgres
-   Terraform
-   Amazon Web Services


## Where {#where}


### Senior Infrastructure Engineer @ [Heroku](https://heroku.com) {#senior-infrastructure-engineer-heroku}


### Co-Founder and Advisor @ [Outdoorly](https://outdoorly.com) {#co-founder-and-advisor-outdoorly}

-   Created an e-commerce marketplace with an intuitive, multi-tenant shopping experience.
-   Attended global trade shows to garner the interest of trending winter sports brands.
-   Brought the pro-form model to the European market, disrupting the current, outdated distribution model.


### Infrastructure Engeering Intern @ [Salesforce](https://salesforce.com) {#infrastructure-engeering-intern-salesforce}

-   Engineered automated cloud architecture with AWS, Terraform, and CoreOS.
-   Developed Terraform testing framework with dynamic resource modeling for granular unit tests.
-   Worked on custom Cloudflare analytics pipeline using Docker, Kubernetes, and Grafana.
-   Recipient of the 2018 Mark Benioff Award for most innovating intern.


### Personal Investing and Digital Platforms Intern @ [Fidelity](https://fidelity.com) {#personal-investing-and-digital-platforms-intern-fidelity}

-   Designed and developed new, internals solutions for enhanced productivity and user experience.


## What is this site? {#what-is-this-site}

Aside from being a personal website, this site hosts my thoughts -- young, old, ill-informed, and carefully considered.

Every word on this site is generated from an Emacs Org file, renered by Hugo, and hosted on Heroku.
